
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_disk_resource_policy_attachment.disk_policy_attachment will be destroyed
  # (because google_compute_disk_resource_policy_attachment.disk_policy_attachment is not in configuration)
  - resource "google_compute_disk_resource_policy_attachment" "disk_policy_attachment" {
      - disk    = "zenpresscloudmail-vault-instance-main" -> null
      - id      = "semiotic-vial-479310-e8/europe-southwest1-a/zenpresscloudmail-vault-instance-main/zenpresscloudmail-vault-snapshot-main" -> null
      - name    = "zenpresscloudmail-vault-snapshot-main" -> null
      - project = "semiotic-vial-479310-e8" -> null
      - zone    = "europe-southwest1-a" -> null
    }

  # google_compute_resource_policy.snapshot_policy must be replaced
-/+ resource "google_compute_resource_policy" "snapshot_policy" {
      ~ id          = "projects/semiotic-vial-479310-e8/regions/europe-southwest1/resourcePolicies/zenpresscloudmail-vault-snapshot-main" -> (known after apply)
        name        = "zenpresscloudmail-vault-snapshot-main"
      ~ region      = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/regions/europe-southwest1" -> (known after apply)
      ~ self_link   = "https://www.googleapis.com/compute/v1/projects/semiotic-vial-479310-e8/regions/europe-southwest1/resourcePolicies/zenpresscloudmail-vault-snapshot-main" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ snapshot_schedule_policy {
          ~ retention_policy {
              ~ max_retention_days    = 31 -> 7 # forces replacement
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.
